In [1]:
import sys; sys.path.append("../")

from clean.new_orleans_pd import clean_personel

In [2]:
history, personel = clean_personel()

In [3]:
personel

             UID  Last Name Middle Name First Name Birth Year Employee ID #
0     d2bd686e63     Conway           D    Corliss       1963        000569
1     abf77e9ac2  Plustache                 Daniel       1958        001142
2     a630a41313   Marshall           M     Tianay       1978        001391
3     cd2570679d     Austin           J    Larissa       1970        001573
4     9bea94b52c      Weber           L     Tamara       1975        001599
...          ...        ...         ...        ...        ...           ...
3766  7cab5fcdac     Denton                  Frank       1935           NaN
3767  45fd2da539     Robert                    May                      NaN
3768  b29a51a000     Jerome                  Moore                      NaN
3769  2ca682ee94      Henry                 Newton                      NaN
3770  ed9de24db6       Alex                  Sider                      NaN

[3771 rows x 6 columns]

In [4]:
history

,UID,Department #,Badge #,Rank Number #,Rank,Year,Police Department
0,d2bd686e63,2702736,00911,C7134,Police Officer 4,2009,New Orleans PD
1,abf77e9ac2,2702740,,C7134,Police Officer 4,2009,New Orleans PD
2,a630a41313,2702735,,C7132,Police Officer 2,2009,New Orleans PD
3,cd2570679d,2702731,,C7133,Police Officer 3,2009,New Orleans PD
4,9bea94b52c,2702750,,C7110,Police Officer 1,2009,New Orleans PD
...,...,...,...,...,...,...,...
1353,7cab5fcdac,,10138,,Reserve Officers,2018,New Orleans PD
1354,45fd2da539,,10128,,Reserve Officers,2018,New Orleans PD
1355,b29a51a000,,10153,,Reserve Officers,2018,New Orleans PD
1356,2ca682ee94,,10082,,Reserve Officers,2018,New Orleans PD
1357,ed9de24db6,,10174,,Reserve Officers,2018,New Orleans PD